NordicSemiconductor/nrfx/mdk/nrf54l09_enga_flpr.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_CLOCK_NS">
      <name>GLOBAL_CLOCK_S</name>
      <description>Clock management 1</description>
      <baseAddress>0x5010E000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>CLOCK_POWER</name>
        <value>270</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_POWER_NS">
      <name>GLOBAL_POWER_S</name>
      <description>Power control 1</description>
      <baseAddress>0x5010E000</baseAddress>
      <alternatePeripheral>GLOBAL_CLOCK_S</alternatePeripheral>
      <!--Security dma=NA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>CLOCK_POWER</name>
        <value>270</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_RESET_NS">
      <name>GLOBAL_RESET_S</name>
      <description>Reset control 1</description>
      <baseAddress>0x5010E000</baseAddress>
      <alternatePeripheral>GLOBAL_CLOCK_S</alternatePeripheral>
      <!--Security dma=NA-->
      <!--Security securemapping=US-->
    </peripheral>
    <peripheral>
      <name>GLOBAL_OSCILLATORS_NS</name>
      <description>Oscillator control 0</description>
      <baseAddress>0x40120000</baseAddress>
      <headerStructName>OSCILLATORS</headerStructName>
      <!--Security dma=NA-->
      <!--Security securemapping=US-->
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <groupName>OSCILLATORS</groupName>
      <size>0x20</size>
      <registers>
        <cluster>
          <name>XOSC32M</name>
          <description>32 MHz oscillator control</description>
          <headerStructName>OSCILLATORS_XOSC32M</headerStructName>
          <access>read-write</access>
          <addressOffset>0x700</addressOffset>
          <cluster>
            <name>CONFIG</name>
            <description>Unspecified</description>
            <headerStructName>OSCILLATORS_XOSC32M_CONFIG</headerStructName>
            <access>read-write</access>
            <addressOffset>0x14</addressOffset>
            <register>
              <name>INTCAP</name>
              <description>Crystal load capacitor as seen by the crystal across its terminals, including pin capacitance but excluding PCB stray capacitance.</description>
              <addressOffset>0x08</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000020</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>VAL</name>
                  <description>Crystal load capacitor value</description>
                  <lsb>0</lsb>
                  <msb>5</msb>
                </field>
              </fields>
            </register>
          </cluster>
        </cluster>
        <cluster>
          <name>PLL</name>
          <description>Oscillator control</description>
          <headerStructName>OSCILLATORS_PLL</headerStructName>
          <access>read-write</access>
          <addressOffset>0x800</addressOffset>
          <register>
            <name>FREQ</name>
            <description>Set speed of MCU power domain, including CPU</description>
            <addressOffset>0x00</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000003</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>FREQ</name>
                <description>Select CPU speed</description>
                <lsb>0</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>CK128M</name>
                    <description>128 MHz</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CK64M</name>
                    <description>64 MHz</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>CURRENTFREQ</name>
            <description>Current speed of MCU power domain, including CPU</description>
            <addressOffset>0x04</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000003</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CURRENTFREQ</name>
                <description>Active CPU speed</description>
                <lsb>0</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>CK128M</name>
                    <description>128 MHz</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CK64M</name>
                    <description>64 MHz</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>XOSC32KI</name>
          <description>32.768 kHz oscillator control</description>
          <headerStructName>OSCILLATORS_XOSC32KI</headerStructName>
          <access>read-write</access>
          <addressOffset>0x900</addressOffset>
          <register>
            <name>INTCAP</name>
            <description>Programmable capacitance of XL1 and XL2</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000017</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>VAL</name>
                <description>Crystal load capacitor as seen by the crystal across its terminals, including pin capacitance but excluding PCB stray capacitance.</description>
                <lsb>0</lsb>
                <msb>4</msb>
              </field>
            </fields>
          </register>
        </cluster>
